runbnbrails/app/controllers/adresses_controller.rb

SELECT "logements".* FROM "logements" WHERE "logements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "adresses" SET "pays" = $1, "ville" = $2, "adresse" = $3, "code" = $4, "updated_at" = $5 WHERE "adresses"."id" = $6  [["pays", "rz@a.com"], ["ville", "azerzty"], ["adresse", "maioson"], ["code", "maioson"], ["updated_at", "2020-10-29 11:02:38.433456"], ["id", 1]]
---
  def update
    log = Logement.find_by(id:params[:longement_id])
    adresse= log.adresse

      if     @adresse = adresse.update(pays:params[:pays],ville:params[:ville],adresse:params[:adresse],code:params[:code])