runbnbrails/app/controllers/avatars_controller.rb

  def create
    @users =User.find(current_user.id)
    @users.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2020-11-03 13:32:23.464764"], ["id", 1]]