runbnbrails/app/controllers/logements_controller.rb

    def create
        puts "~"*24
        puts params.inspect
        puts "~"*24
        @logement = Logement.new(logement_params)
        @logement.user_id = current_user.id
        @logement.save

        @chambre = Chambre.create(title:"Chambre",logement_id: @logement.id)
        @salon = Salon.create(title: "Salon",logement_id: @logement.id)
        @autre = Autre.create(title: "Autre espace",logement_id: @logement.id)


        #adresse controller new
        @adresse = Adresse.new(adresse_params)
        @adresse.logement_id = @logement.id
        @adresse.save

        #map controller new
        @map = Map.new(map_params)
        @map.logement_id = @logement.id
        @map.save

        #conditions controller new
        @condition = Condition.new(condition_params)
        @condition.logement_id = @logement.id
        @condition.save

        #equipement controller new
        @equipement = Equipement.create(title: params[:title],logement_id:@logement.id)
---
INSERT INTO "logements" ("name", "categorie", "types", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["categorie", ""], ["types", ""], ["user_id", 1], ["created_at", "2020-10-30 07:07:05.888263"], ["updated_at", "2020-10-30 07:07:05.888263"]]
INSERT INTO "chambres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Chambre"], ["logement_id", 29], ["created_at", "2020-10-30 07:07:06.412532"], ["updated_at", "2020-10-30 07:07:06.412532"]]
INSERT INTO "salons" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Salon"], ["logement_id", 29], ["created_at", "2020-10-30 07:07:06.659548"], ["updated_at", "2020-10-30 07:07:06.659548"]]
INSERT INTO "salons" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Salon"], ["logement_id", 24], ["created_at", "2020-11-02 12:16:22.517143"], ["updated_at", "2020-11-02 12:16:22.517143"]]
INSERT INTO "chambres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Chambre"], ["logement_id", 24], ["created_at", "2020-11-02 12:16:22.486880"], ["updated_at", "2020-11-02 12:16:22.486880"]]
INSERT INTO "autres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Autre espace"], ["logement_id", 29], ["created_at", "2020-10-30 07:07:06.817300"], ["updated_at", "2020-10-30 07:07:06.817300"]]
INSERT INTO "adresses" ("pays", "ville", "adresse", "code", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["pays", "aa"], ["ville", "a"], ["adresse", "12"], ["code", "12"], ["logement_id", 8], ["created_at", "2020-10-29 14:24:30.027128"], ["updated_at", "2020-10-29 14:24:30.027128"]]
INSERT INTO "logements" ("name", "categorie", "types", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["categorie", ""], ["types", ""], ["user_id", 1], ["created_at", "2020-11-02 12:16:22.456542"], ["updated_at", "2020-11-02 12:16:22.456542"]]
INSERT INTO "maps" ("latitude", "longitude", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", -21.121661209928707], ["longitude", 55.53817922704148], ["logement_id", 8], ["created_at", "2020-10-29 14:24:30.059652"], ["updated_at", "2020-10-29 14:24:30.059652"]]
INSERT INTO "conditions" ("conditions", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["conditions", "1 jours"], ["logement_id", 8], ["created_at", "2020-10-29 14:24:30.093520"], ["updated_at", "2020-10-29 14:24:30.093520"]]
INSERT INTO "chambres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Chambre"], ["logement_id", 1], ["created_at", "2020-11-02 07:12:14.222775"], ["updated_at", "2020-11-02 07:12:14.222775"]]
INSERT INTO "salons" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Salon"], ["logement_id", 1], ["created_at", "2020-11-02 07:12:14.261312"], ["updated_at", "2020-11-02 07:12:14.261312"]]
INSERT INTO "autres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Autre espace"], ["logement_id", 1], ["created_at", "2020-11-02 07:12:14.297575"], ["updated_at", "2020-11-02 07:12:14.297575"]]
INSERT INTO "conditions" ("conditions", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["conditions", "1 jours"], ["logement_id", 24], ["created_at", "2020-11-02 12:16:22.659618"], ["updated_at", "2020-11-02 12:16:22.659618"]]

         #regle controller new
         @regle = Regle.new(regle_params)
         @regle.logement_id = @logement.id
         @regle.save
---
INSERT INTO "regles" ("regle", "arrive1", "arrive2", "depart1", "depart2", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

         #calendrier controller new
         @cal = Calendrier.new(cal_params)
         @cal.logement_id = @logement.id
         @cal.save
---
INSERT INTO "calendriers" ("startDate", "endDate", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["startDate", "2020-10-28 21:00:00"], ["endDate", "2020-11-20 21:00:00"], ["logement_id", 8], ["created_at", "2020-10-29 14:24:30.223789"], ["updated_at", "2020-10-29 14:24:30.223789"]]

         #lits controller new
         @lits = Lit.new(lits_params)
         @lits.chambre_id = @chambre.id
         @lits.save
---
INSERT INTO "lits" ("chambre_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["chambre_id", 40], ["created_at", "2020-10-30 08:51:51.766837"], ["updated_at", "2020-10-30 08:51:51.766837"]]

         #canapes controller new
         @canape = Canape.new(canapes_params)
         @canape.salon_id = @salon.id
         @canape.save
---
INSERT INTO "canapes" ("salon_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["salon_id", 2], ["created_at", "2020-10-30 10:44:03.729202"], ["updated_at", "2020-10-30 10:44:03.729202"]]

         #autre controller new
         @autre = Autrelit.new(autre_params)
         @autre.autre_id = @autre.id
         @autre.save
---
INSERT INTO "autrelits" ("name", "quantite", "checked", "autre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lit Simple"], ["quantite", 0], ["checked", false], ["autre_id", 64], ["created_at", "2020-11-02 13:27:52.819295"], ["updated_at", "2020-11-02 13:27:52.819295"]]
INSERT INTO "lits" ("name", "quantite", "checked", "chambre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lit Double"], ["quantite", 0], ["checked", true], ["chambre_id", 64], ["created_at", "2020-11-02 13:27:52.555575"], ["updated_at", "2020-11-02 13:27:52.555575"]]

    def update
        log = Logement.find_by(id:params[:id])

        if log=log.update(name:params[:name],types:params[:types],categorie:params[:categorie])
---
SELECT "logements".* FROM "logements" WHERE "logements"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "logements" SET "name" = $1, "types" = $2, "categorie" = $3, "updated_at" = $4 WHERE "logements"."id" = $5  [["name", "rz@gmail.com"], ["types", "maioson"], ["categorie", "azerzty"], ["updated_at", "2020-10-29 08:43:41.932272"], ["id", 1]]