runbnbrails/app/controllers/logements_controller.rb

SELECT "logements".* FROM "logements" WHERE "logements"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "logements" SET "name" = $1, "types" = $2, "categorie" = $3, "updated_at" = $4 WHERE "logements"."id" = $5  [["name", "rz@gmail.com"], ["types", "maioson"], ["categorie", "azerzty"], ["updated_at", "2020-10-29 08:43:41.932272"], ["id", 1]]
---
    def update
        log = Logement.find_by(id:params[:id])

        if log=log.update(name:params[:name],types:params[:types],categorie:params[:categorie])