runbnbrails/app/controllers/users_controller.rb

    def show
        show= User.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @user = User.find_by(email: params[:email])
        if @user

            render json:{
            email:"Email déjà existé"
            }
        else

            @user = User.create!(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "flsdklfs"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "name", "first_name", "mobile", "date_of_birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        @users =User.find_by(id:params[:id])
       @users.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "bnb aer"], ["updated_at", "2020-10-29 14:14:10.233086"], ["id", 2]]